; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	infrared2 - mode
	thermograph1 - mode
	spectrograph0 - mode
	infrared3 - mode
	image4 - mode
	image5 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation6 - direction
	GroundStation9 - direction
	GroundStation11 - direction
	GroundStation13 - direction
	GroundStation8 - direction
	Star12 - direction
	GroundStation7 - direction
	GroundStation10 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Star14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 image5)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation8)
	(supports instrument1 infrared3)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star12)
	(calibration_target instrument1 GroundStation10)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation10)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument3 infrared3)
	(supports instrument3 spectrograph0)
	(supports instrument3 image5)
	(supports instrument3 image4)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation10)
)
(:goal (and
	(pointing satellite1 Star12)
	(have_image Star14 infrared3)
	(have_image Phenomenon15 spectrograph0)
	(have_image Star16 spectrograph0)
	(have_image Planet17 infrared3)
	(have_image Planet17 image4)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 6
2. (turn_to satellite1 groundstation4 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 6
3. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 0 of 6
4. (turn_to satellite1 phenomenon15 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon15)
   goals met: 0 of 6
5. (take_image satellite1 phenomenon15 instrument3 spectrograph0)
   added: (have_image phenomenon15 spectrograph0)
   goals met: 1 of 6
6. (turn_to satellite1 planet17 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 planet17)
   goals met: 1 of 6
7. (take_image satellite1 planet17 instrument3 image4)
   added: (have_image planet17 image4)
   goals met: 2 of 6
8. (take_image satellite1 planet17 instrument3 infrared3)
   added: (have_image planet17 infrared3)
   goals met: 3 of 6
9. (turn_to satellite1 star12 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 star12)
   goals met: 4 of 6
10. (turn_to satellite1 star14 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star14)
   goals met: 3 of 6
11. (take_image satellite1 star14 instrument3 infrared3)
   added: (have_image star14 infrared3)
   goals met: 4 of 6
12. (turn_to satellite1 star12 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star12)
   goals met: 5 of 6
13. (turn_to satellite1 star16 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star16)
   goals met: 4 of 6
14. (take_image satellite1 star16 instrument3 spectrograph0)
   added: (have_image star16 spectrograph0)
   goals met: 5 of 6
15. (turn_to satellite1 star12 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star12)
   goals met: 6 of 6
